'''
Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
*Пример:*
2 2
    4 

 '''

def sum(a, b):
    if (b == 1):
        return (a)
    if (b != 1):
        return (a + sum(a, b - 1))

a = int(input("Введите A: "))
b = int(input("Введите B: "))
print("Сумма:", sum(a, b))
