"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""
print("Введите число:")
x = int(input())
summ = x % 10
while x > 0:
    x = x // 10
    #print(x)
    summ = summ + x % 10
print(f'Сумма цифр равна = {summ}')

