"""
Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
*Пример:*
385916 -> yes
123456 -> no
"""
print("Введите номер билета:")
x = input()
s1 = int(x[0]) + int(x[1]) + int(x[2])
s2 = int(x[3]) + int(x[4]) + int(x[5])
if s1 == s2:
    print("YES")
else:
    print("NO")
