"""
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
 а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
    60 -> 10  40  10
"""
print("Введите общее количество журавликов:")
x = int(input())
if (x % 6) != 0:
    print("Кто то мухлюет")
else:
    petya = x / 3
    katya = x / 3
    sergey = x / 3
    petya = petya / 2
    sergey = sergey / 2
    katya = katya + petya + sergey
    print(f"Петя = {petya}")
    print(f"Катя = {katya}")
    print(f"Сергей = {sergey}")
