'''
Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек 
отломить k долек, если разрешается сделать один разлом по прямой между 
дольками (то есть разломить шоколадку на два прямоугольника).

*Пример:*
3 2 4 -> yes
3 2 1 -> no
'''
print("Введите размер шоколада по M:")
n = int(input())
print("Введите размер шоколада по N:")
m = int(input())
print("Введите количество отламываемых долек:")
k = int(input())
if k < n * m and ((k % n == 0) or (k % m == 0)):
    print('разлом разрешается')
else:
    print('разлом невозможен')