"""
Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
*Пример:*
5
    1 2 3 4 5
    6
    -> 5
"""
import random

print("Введите количество чисел:")
n = int(input())
MASS = [0] * n
for i in range(0, n):
    MASS[i] = random.randint(0, 10)
print(f"Массив: {MASS}")
print("Введите искомое число:")
x = int(input())
found = MASS[0]
for i in MASS:
    if abs(i - x) < abs(found - x):
        found = i
print(f"Самое близкое к искомому: {found}")
