"""
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
*Пример:*
5
    1 2 3 4 5
    3
    -> 1
"""
import random

print("Введите количество чисел:")
n = int(input())
MASS = [0] * n
for i in range(0, n):
    MASS[i] = random.randint(0, 10)
print(f"Массив: {MASS}")
print("Введите искомое число:")
x = int(input())
summ = 0
for i in range(0, n):
    if MASS[i] == x:
        summ += 1
print(f"Число {x} встречается в массиве {summ} раз")
