"""
Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
 Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
   Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
"""
import random
import math
a = random.randint(0, 1000)
b = random.randint(0, 1000)
#print(a)
#print(b)
S = a + b
P = a * b
print(f"Сумма чисел равна {S}")
print(f"произведение чисел равно {P}")

d = S * S - 4 * P
if d < 0:
    print("не получается!")
else:
    sd = math.sqrt(d)
    y = (S + sd) / 2
    x = S - y
    print(x)
    print(y)
