'''Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
 Выведите минимальное количество монет, которые нужно перевернуть
 '''
import random
print("Введите количество монет:")
n = int(input())
MASS=[0]*n
for i in range(0, n):
    MASS[i]=random.randint(0, 1)
print(f'Массив монет {MASS}')
orel=0
reshka=0
for i in range(0, n):
    if MASS[i]==0:
        orel+=1
    else: reshka+=1
if orel<reshka:
    print(f'Переворачиваем {orel} монет')
else:
    print(f'Переворачиваем {reshka} монет')
